import PanelLayout, { PADDING_LAYOUT } from "@/Layouts/PanelLayout";
import Head from "next/head";

const PRIVACY_ITEMS = [
  "تعهدات پایه‌ای شرکت دراپ با شماره ثبت ۱۲۳۴ به منظور تسهیل و تسریع فعالیت‌های حمل و نقل بار، اپلیکیشن دراپ را راه‌اندازی کرده است و تحت شروط خاصی که در ادامه بیان می‌شود، خدمات خود را ارائه می‌دهد. بنابراین این شروط قلمرو قرارداد بین صاحب بار، راننده و دراپ را تشکیل می‌دهند. این قرارداد تابع قوانین جمهوری اسلامی ایران است و در صورت پیدایش هرگونه اختلاف و عدم حل آن به صورت صلح‌آمیز، طرفین اختلاف باید برای حل آن به دادگاه‌های رسمی ایران مراجعه کنند. استفاده از اپلیکیشن دراپ نشان دهنده‌ی پذیرش تمام شروط ذکر شده در قرارداد توسط کاربر است. لذا کاربر باید این شروط را با دقت بخواند و هیچ‌گونه ادعای عدم آگاهی را نمی‌توان پذیرفت. خدمات و قوانین اپلیکیشن در طول زمان ممکن است تغییر کنند و از طریق خود اپلیکیشن به دست کاربران برسند. ادامه دادن استفاده از اپلیکیشن توسط کاربر به منزله‌ی قبول تغییرات در خدمات و قوانین اپلیکیشن است.",
  "حقوق مادی و معنوی این اپلیکیشن مخصوص شرکت دراپ است. همه‌ی اشخاص حقیقی و حقوقی صاحب ناوگان حمل بار، با تحویل مدارک و اطلاعات لازم به اپلیکیشن، می‌توانند بدون هزینه کاربر این اپلیکیشن باشند. تعهدات مالی با توجه به اینکه هزینه‌ی حمل بار بر اساس تفاهم بین صاحب بار و راننده مشخص می‌شود، هیچ‌کدام از طرفین مذکور پس از تفاهم حق اعتراض یا انتقاد از هزینه‌ی حمل بار را ندارند. در صورتی که کاربر به عمد یا سهو مرتکب عملی شود که باعث آسیب به دراپ یا آبرو ریزی دراپ شود، دراپ حق دارد با توجه به شرایط و شدّت تخلف، اقدامات لازم را انجام دهد. این اقدامات ممکن است شامل تذکر، جریمه، قطع خدمات یا لغو حساب کاربری باشند. در صورت بروز هرگونه تغییر در قوانین و مقررات، دراپ موظف است آن را به روش مناسب به اطلاع کاربران برساند.",
  "استفاده از اپلیکیشن پس از تغییرات به منزله‌ی پذیرش آن‌ها تلقی می‌شود. تعهدات غیرمالی کاربران این اپلیکیشن نیاز به گوشی تلفن همراه هوشمند و اینترنت دارند. کاربر متعهد می‌شود که از حساب کاربری خود فقط برای ناوگان و راننده‌ای که اطلاعاتش در حساب کاربری ثبت شده است استفاده کند. کاربر نمی‌تواند ناوگان یا راننده‌ای را مغایر با اطلاعات ثبت شده در حساب کاربری به محل بارگیری یا باربری ارسال کند. کاربر متعهد می‌شود که از اطلاعاتی که از طریق دراپ به وی داده شده است، قبل یا بعد یا حین فرآیند حمل بار، بدون رضایت دراپ استفاده نکند. کاربر متعهد می‌شود که از اپلیکیشن دراپ به صورت قانون‌مند و اخلاق‌مند استفاده کند و هرگونه تخلف از قوانین جمهوری اسلامی ایران را انجام ندهد. کاربر متعهد می‌شود که در صورت بروز هرگونه مشکل یا سوال در خصوص خدمات دراپ، با پشتیبانی دراپ تماس بگیرد و از طریق سایر رسانه‌ها یا شبکه‌های اجتماعی اقدام به تخریب یا توهین به دراپ نکند. کاربر متعهد می‌شود که همواره رفتار مناسب و حرفه‌ای با صاحب بار، راننده، باربر و سایر افراد دخیل در فرآیند حمل بار داشته باشد.",
  "کاربر متعهد می‌شود که همواره نظافت و سلامت ناوگان خود را حفظ کند و از حمل بار نامناسب یا خطرآفرین خودداری کند. کاربر متعهد می‌شود که همواره با دقت و سرعت مناسب رانندگی کند و از تصادفات جادوی یا شهری پرهیز کند. گزارش دقیق و صادقانه‌ای از وضعیت ارائه دهد. در صورت لزوم، با پلیس ۱۱۰ یا سایر نهاد‌های قانون‌گذار تماس بگیرد و از ثبت پرونده خودداری نکند. در صورت عدم رعایت هر یک از تعهدات ذکر شده، دراپ حق دارد با توجه به شرایط و شدّت تخلف، اقدامات لازم را انجام دهد. این اقدامات ممکن است شامل تذکر، جریمه، قطع خدمات یا لغو حساب کاربری باشند. تعرفه خدمات در حال حاضر استفاده از اپلیکیشن دراپ رایگان بوده و تمامی اشخاص حقیقی و حقوقی مجازند از اپلیکیشن استفاده کنند. بدیهی است که دراپ حق عدم ارایه‌ی خدمات بنا بر اولویت‌های تجاری را برای خود محفوظ می‌دارد. در آینده ممکن است دراپ در ازای خدمات ارایه شده مبلغی را از کاربران دریافت نماید. بدیهی است این تغییرات قبل از اعمال در همین صفحه اعلام خواهد شد.",
];

const PRIVACY_ITEMS_FIRST = [
  {
    title: "دراپ",
    desc: "شرکت دراپ با شماره ثبت ۱۲۳۴ که از طریق اپلیکیشن دراپ خدمات حمل و نقل بار را ارائه می‌دهد و در این قوانین و مقررات با نام «دراپ» شناسایی می‌شود.",
  },
  {
    title: "کاربر",
    desc: "هر فرد حقیقی یا حقوقی که از اپلیکیشن دراپ استفاده می‌کند و در این قوانین و مقررات با نام «کاربر» شناسایی می‌شود. ",
  },
  {
    title: "",
    desc: "کاربران عبارتند از:",
  },
  {
    title: "صاحب بار",
    desc: "هر فرد حقیقی یا حقوقی که از طریق اپلیکیشن دراپ درخواست حمل بار می‌دهد.",
  },
  {
    title: "راننده",
    desc: "هر فرد حقیقی یا حقوقی که دارای ناوگان حمل بار است و از طریق اپلیکیشن دراپ پذیرش درخواست حمل بار می‌کند.",
  },
];

const Privacy = () => {
  return (
    <>
      <Head>
        <title> دراپ - قـوانـیـن و مـقـررات </title>
      </Head>

      <div className={`bg-white py-32 ${PADDING_LAYOUT}`}>
        <h3 className="mb-12 text-center text-3.2xl font-bold text-primary-900">
          قـوانـیـن و مـقـررات
        </h3>

        <div className="flex  flex-col gap-6 text-justify">
          {PRIVACY_ITEMS_FIRST.map((item, i) => {
            return (
              <div className="grid gap-1" key={i}>
                <h1 className="text-2xl font-bold">{item.title}</h1>
                <div>{item.desc}</div>
              </div>
            );
          })}
        </div>
        <div className="flex  flex-col gap-6 text-justify mt-16">
          {PRIVACY_ITEMS.map((item, i) => {
            return <p key={i}>{item}</p>;
          })}
        </div>
      </div>
    </>
  );
};

Privacy.PageLayout = PanelLayout;
export default Privacy;
